[Killed] LogicalNotExpression to un-LogicalNotExpression mutation
Services/AuthHeaderService.cs:21:17
 
         public string GetTokenOnly()
         {
-            if (!_httpContextAccessor.HttpContext.Request.Headers.TryGetValue("Authorization", out var outJWT))
+            if (_httpContextAccessor.HttpContext.Request.Headers.TryGetValue("Authorization", out var outJWT))
             {
                 return string.Empty;

[Survived] Linq method mutation (FirstOrDefault() to First())
Services/AuthHeaderService.cs:25:31
             {
                 return string.Empty;
             }
-            var headerValue = outJWT.FirstOrDefault(o => o.StartsWith("Bearer", StringComparison.InvariantCultureIgnoreCase));
+            var headerValue = outJWT.First(o => o.StartsWith("Bearer", StringComparison.InvariantCultureIgnoreCase));
             if (string.IsNullOrWhiteSpace(headerValue))
             {

[Killed] Negate expression
Services/AuthHeaderService.cs:26:17
                 return string.Empty;
             }
             var headerValue = outJWT.FirstOrDefault(o => o.StartsWith("Bearer", StringComparison.InvariantCultureIgnoreCase));
-            if (string.IsNullOrWhiteSpace(headerValue))
+            if (!(string.IsNullOrWhiteSpace(headerValue)))
             {
                 return string.Empty;
