[Killed] Array initializer mutation
Controllers/ValuesController.cs:16:20
         [HttpGet]
         public IEnumerable<string> Get()
         {
-            return new string[] { "value1", "value2" };
+            return new string[] {};
         }
 
