[Killed] Negate expression
Services/HttpRequestHeaderExactMatchRuleService.cs:28:17
         {
 
             var metaRuleObject = JsonConvert.DeserializeObject<MetaHttpRequestHeaderExactMatch>(meta);
-            if (_httpContextAccessor.HttpContext.Request.Headers.TryGetValue(metaRuleObject.Header, out var outHeaderValue))
+            if (!(_httpContextAccessor.HttpContext.Request.Headers.TryGetValue(metaRuleObject.Header, out var outHeaderValue)))
             {
                 var headerValue = outHeaderValue.FirstOrDefault(o => o.Equals(metaRuleObject.Value, StringComparison.InvariantCultureIgnoreCase));

[Survived] Linq method mutation (FirstOrDefault() to First())
Services/HttpRequestHeaderExactMatchRuleService.cs:30:35
             var metaRuleObject = JsonConvert.DeserializeObject<MetaHttpRequestHeaderExactMatch>(meta);
             if (_httpContextAccessor.HttpContext.Request.Headers.TryGetValue(metaRuleObject.Header, out var outHeaderValue))
             {
-                var headerValue = outHeaderValue.FirstOrDefault(o => o.Equals(metaRuleObject.Value, StringComparison.InvariantCultureIgnoreCase));
+                var headerValue = outHeaderValue.First(o => o.Equals(metaRuleObject.Value, StringComparison.InvariantCultureIgnoreCase));
                 if (!string.IsNullOrWhiteSpace(headerValue))
                 {

[Killed] LogicalNotExpression to un-LogicalNotExpression mutation
Services/HttpRequestHeaderExactMatchRuleService.cs:31:21
             if (_httpContextAccessor.HttpContext.Request.Headers.TryGetValue(metaRuleObject.Header, out var outHeaderValue))
             {
                 var headerValue = outHeaderValue.FirstOrDefault(o => o.Equals(metaRuleObject.Value, StringComparison.InvariantCultureIgnoreCase));
-                if (!string.IsNullOrWhiteSpace(headerValue))
+                if (string.IsNullOrWhiteSpace(headerValue))
                 {
                     return Constants.Common.THIS_FEATURE_IS_ON;
