[Killed] Negate expression
Services/JwtPayloadParseMatchInListRuleService.cs:28:17
 
         public bool Run(string meta)
         {
-            if (string.IsNullOrWhiteSpace(meta))
+            if (!(string.IsNullOrWhiteSpace(meta)))
             {
                 return Constants.Common.THIS_FEATURE_IS_OFF;

[Killed] Negate expression
Services/JwtPayloadParseMatchInListRuleService.cs:35:17
 
             var metaRuleObject = JsonConvert.DeserializeObject<MetaJwtParseMatchInList>(meta);
             var headerValue = _authHeaderService.GetTokenOnly();
-            if (string.IsNullOrWhiteSpace(headerValue))
+            if (!(string.IsNullOrWhiteSpace(headerValue)))
             {
                 return Constants.Common.THIS_FEATURE_IS_OFF;

[Killed] LogicalNotExpression to un-LogicalNotExpression mutation
Services/JwtPayloadParseMatchInListRuleService.cs:41:17
             }
 
             var handler = new JwtSecurityTokenHandler();
-            if (!TryGetJWTPayloadAsString(headerValue, out var jsonString))
+            if (TryGetJWTPayloadAsString(headerValue, out var jsonString))
             {
                 return Constants.Common.THIS_FEATURE_IS_OFF;

[Killed] Equality mutation
Services/JwtPayloadParseMatchInListRuleService.cs:48:17
             var jsonObject = JToken.Parse(jsonString);
 
             var jsonToken = jsonObject.SelectToken(metaRuleObject.Path);
-            if (jsonToken != null)
+            if (jsonToken == null)
             {
                 if (metaRuleObject.List != null

[Killed] Equality mutation
Services/JwtPayloadParseMatchInListRuleService.cs:50:21
             var jsonToken = jsonObject.SelectToken(metaRuleObject.Path);
             if (jsonToken != null)
             {
-                if (metaRuleObject.List != null
+                if (metaRuleObject.List == null
+
                     && metaRuleObject.List.ToUpper().Split(',').Contains(jsonToken.ToString().ToUpper()))
                 {

[Killed] Logical mutation
Services/JwtPayloadParseMatchInListRuleService.cs:50:21
             var jsonToken = jsonObject.SelectToken(metaRuleObject.Path);
             if (jsonToken != null)
             {
-                if (metaRuleObject.List != null
-                    && metaRuleObject.List.ToUpper().Split(',').Contains(jsonToken.ToString().ToUpper()))
+                if (metaRuleObject.List != null
+                    || metaRuleObject.List.ToUpper().Split(',').Contains(jsonToken.ToString().ToUpper()))
                 {
                     return Constants.Common.THIS_FEATURE_IS_ON;

[Killed] Equality mutation
Services/JwtPayloadParseMatchInListRuleService.cs:67:17
             //Check if readable token (string is in a JWT format)
             var readableToken = jwtHandler.CanReadToken(jwtInput);
 
-            if (readableToken == true)
+            if (readableToken != true)
             {
                 try

[Killed] Boolean mutation
Services/JwtPayloadParseMatchInListRuleService.cs:67:34
             //Check if readable token (string is in a JWT format)
             var readableToken = jwtHandler.CanReadToken(jwtInput);
 
-            if (readableToken == true)
+            if (readableToken == false)
             {
                 try

[Killed] Boolean mutation
Services/JwtPayloadParseMatchInListRuleService.cs:92:28
                     }
                     jwtPayload += "}";
                     result += JToken.Parse(jwtPayload).ToString(Formatting.Indented);
-                    return true;
+                    return false;
                 }
                 catch (ArgumentException)

[NoCoverage] Boolean mutation
Services/JwtPayloadParseMatchInListRuleService.cs:97:28
                 catch (ArgumentException)
                 {
                     //Some kind of JWT Garbage token
-                    return false;
+                    return true;
                 }
             }
