[Survived] Collection initializer mutation
Services/InMemoryFeatureService.cs:22:25
         {
             new Feature{
                 Name=Constants.TestValues.FeatureNames.ALWAYS_OFF,
-                Rules = new List<Rule>{ new Rule { Type = ruleType.boolean, Meta="false"} } },
+                Rules = new List<Rule>{} },
             new Feature{
                 Name=Constants.TestValues.FeatureNames.ALWAYS_ON,

[Survived] Collection initializer mutation
Services/InMemoryFeatureService.cs:27:25
                 Name=Constants.TestValues.FeatureNames.ALWAYS_ON,
                 Rules = new List<Rule>{ new Rule { Type = ruleType.boolean, Meta="true"} } },
             new Feature{ Name=Constants.TestValues.FeatureNames.JWT_EMAIL_PARSE,
-                Rules = new List<Rule>{
-                    new Rule { Type = ruleType.jwtPayloadClaimMatchesValueInList, Meta= "{ \"Path\":\"$.email\", \"List\":\"testuser1@example.com,testuser2@example.com,johndoe@example.com\"}", }
-                },
+                Rules = new List<Rule>{},
             },
             new Feature{ Name=Constants.TestValues.FeatureNames.JWT_EMAIL_PARSE_AND_ENVIRONMENT_HEADER,
