[NoCoverage] Linq method mutation (Any() to All())
SwaggerUI/AuthorizationHeader.cs:20:32
         public void Apply(OpenApiOperation operation, OperationFilterContext context)
         {
             var actionMetadata = context.ApiDescription.ActionDescriptor.EndpointMetadata;
-            var isAuthorized = actionMetadata.Any(metadataItem => metadataItem is AuthorizeAttribute);
+            var isAuthorized = actionMetadata.All(metadataItem => metadataItem is AuthorizeAttribute);
             var allowAnonymous = actionMetadata.Any(metadataItem => metadataItem is AllowAnonymousAttribute);
 

[NoCoverage] Linq method mutation (Any() to All())
SwaggerUI/AuthorizationHeader.cs:21:34
         {
             var actionMetadata = context.ApiDescription.ActionDescriptor.EndpointMetadata;
             var isAuthorized = actionMetadata.Any(metadataItem => metadataItem is AuthorizeAttribute);
-            var allowAnonymous = actionMetadata.Any(metadataItem => metadataItem is AllowAnonymousAttribute);
+            var allowAnonymous = actionMetadata.All(metadataItem => metadataItem is AllowAnonymousAttribute);
 
             //if (!isAuthorized || allowAnonymous)

[NoCoverage] Equality mutation
SwaggerUI/AuthorizationHeader.cs:27:17
             //{
             //    return;
             //}
-            if (operation.Parameters == null)
+            if (operation.Parameters != null)
                 operation.Parameters = new List<OpenApiParameter>();
 
