[Killed] LogicalNotExpression to un-LogicalNotExpression mutation
Services/RulesEngineService.cs:44:60
         public EvaluationResponse Run(EvaluationRequest input)
         {
             var result = new EvaluationResponse();
-            if (input == null || input.Features == null || !input.Features.Any())
+            if (input == null || input.Features == null || input.Features.Any())
             {
                 return result;

[Killed] Negate expression
Services/RulesEngineService.cs:44:17
         public EvaluationResponse Run(EvaluationRequest input)
         {
             var result = new EvaluationResponse();
-            if (input == null || input.Features == null || !input.Features.Any())
+            if (!(input == null || input.Features == null || !input.Features.Any()))
             {
                 return result;

[Killed] Linq method mutation (FirstOrDefault() to First())
Services/RulesEngineService.cs:52:41
 
             foreach (var requestedFeature in input.Features)
             {
-                var featureToEvaluate = _featureRepository.GetAll().FirstOrDefault(o =>
-                o.Name.Equals(requestedFeature, StringComparison.InvariantCultureIgnoreCase));
+                var featureToEvaluate = _featureRepository.GetAll().First(o =>
+                o.Name.Equals(requestedFeature, StringComparison.InvariantCultureIgnoreCase));
                 if (featureToEvaluate == null)
                 {

[Killed] Equality mutation
Services/RulesEngineService.cs:54:21
             {
                 var featureToEvaluate = _featureRepository.GetAll().FirstOrDefault(o =>
                 o.Name.Equals(requestedFeature, StringComparison.InvariantCultureIgnoreCase));
-                if (featureToEvaluate == null)
+                if (featureToEvaluate != null)
                 {
                     /* Even if the feature has not been defined

[Survived] Boolean mutation
Services/RulesEngineService.cs:82:33
         public bool RunAllRules(List<Model.Rule> rules)
         {
 
-            var runningResult = true;
+            var runningResult = false;
             foreach (var rule in rules)
             {

[Survived] Equality mutation
Services/RulesEngineService.cs:97:21
                         runningResult = _jwtPayloadParseMatchInListRuleService.Run(rule.Meta);
                         break;
                 }
-                if (runningResult == Constants.Common.THIS_FEATURE_IS_OFF)
+                if (runningResult != Constants.Common.THIS_FEATURE_IS_OFF)
                 {
                     /*We only support inclusive AND for the running of multiple rules.

[Killed] LogicalNotExpression to un-LogicalNotExpression mutation
Services/RulesEngineService.cs:113:17
 
         public bool BooleanRule(string meta)
         {
-            if (!Boolean.Parse(meta))
+            if (Boolean.Parse(meta))
             {
                 return Constants.Common.THIS_FEATURE_IS_OFF;
