[NoCoverage] Boolean mutation
SwaggerUI/EnvironmentHeader.cs:21:16
 				Name = "x-env",
 				In = ParameterLocation.Header,
 				Description = "Custom Environment Header",
-				Required = false // set to false if this is optional
+				Required = true // set to false if this is optional
 			});
 		}
